shohei/ArduinoProject/Experiment/attiny2313_test/hardware/avr/boards.txt
############################################
avrtiny45.name=ATtiny45 / Int.8MHz
avrtiny45.upload.using=arduino:arduinoisp
avrtiny45.upload.maximum_size=4096

avrtiny45.bootloader.low_fuses=0xe2
avrtiny45.bootloader.high_fuses=0xdd
avrtiny45.bootloader.path=dummy
avrtiny45.bootloader.file=dummy.hex
avrtiny45.bootloader.unlock_bits=0x3F
avrtiny45.bootloader.lock_bits=0x3F

avrtiny45.build.mcu=attiny45
avrtiny45.build.f_cpu=8000000L
avrtiny45.build.core=attiny45_85

############################################
avrtiny85.name=ATtiny85 / Int.8MHz
avrtiny85.upload.using=arduino:arduinoisp
avrtiny85.upload.maximum_size=8192
avrtiny85.bootloader.low_fuses=0xe2
avrtiny85.bootloader.high_fuses=0xdd
avrtiny85.bootloader.path=dummy
avrtiny85.bootloader.file=dummy.hex
avrtiny85.bootloader.unlock_bits=0x3F
avrtiny85.bootloader.lock_bits=0x3F
avrtiny85.build.mcu=attiny85
avrtiny85.build.f_cpu=8000000L
avrtiny85.build.core=attiny45_85

############################################
avrtiny2313.name=ATtiny2313 / Int.8MHz
avrtiny2313.upload.using=arduino:arduinoisp
avrtiny2313.upload.maximum_size=2048
avrtiny2313.bootloader.low_fuses=0xe4
avrtiny2313.bootloader.high_fuses=0xdf
avrtiny2313.bootloader.path=dummy
avrtiny2313.bootloader.file=dummy.hex
avrtiny2313.bootloader.unlock_bits=0x3F
avrtiny2313.bootloader.lock_bits=0x3F
avrtiny2313.build.mcu=attiny2313
avrtiny2313.build.f_cpu=8000000L
avrtiny2313.build.core=attiny2313

###########################################
avr88p.name=ATmega88P / Int.8MHz

avr88p.upload.using=arduino:arduinoisp
avr88p.upload.maximum_size=8192

avr88p.bootloader.low_fuses=0xe2
avr88p.bootloader.high_fuses=0xdd
avr88p.bootloader.extended_fuses=0x07
avr88p.bootloader.path=dummy
avr88p.bootloader.file=dummy.hex
avr88p.bootloader.unlock_bits=0x3F
avr88p.bootloader.lock_bits=0x3F

avr88p.build.mcu=atmega88p
avr88p.build.f_cpu=8000000L
avr88p.build.core=arduino

###########################################
avr168p.name=ATmega168P / Int.8MHz

avr168p.upload.using=arduino:arduinoisp
avr168p.upload.maximum_size=16384

avr168p.bootloader.low_fuses=0xe2
avr168p.bootloader.high_fuses=0xdd
avr168p.bootloader.extended_fuses=0x07
avr168p.bootloader.path=dummy
avr168p.bootloader.file=dummy.hex
avr168p.bootloader.unlock_bits=0x3F
avr168p.bootloader.lock_bits=0x3F

avr168p.build.mcu=atmega168p
avr168p.build.f_cpu=8000000L
avr168p.build.core=arduino


############################################
avr328p.name= ATmega328P / Int.8MHz
avr328p.upload.using=arduino:arduinoisp
avr328p.upload.maximum_size=32768

avr328p.bootloader.low_fuses=0xe2
avr328p.bootloader.high_fuses=0xde
avr328p.bootloader.extended_fuses=0x05
avr328p.bootloader.path=dummy
avr328p.bootloader.file=dummy.hex
avr328p.bootloader.unlock_bits=0x3F
avr328p.bootloader.lock_bits=0x3F

avr328p.build.mcu=atmega328p
avr328p.build.f_cpu=8000000L
avr328p.build.core=arduino

############################################
avr328p16.name= ATmega328P / Ext.16MHz
avr328p16.upload.using=arduino:arduinoisp
avr328p16.upload.maximum_size=32768

avr328p16.bootloader.low_fuses=0xff
avr328p16.bootloader.high_fuses=0xde
avr328p16.bootloader.extended_fuses=0x05
avr328p16.bootloader.path=dummy
avr328p16.bootloader.file=dummy.hex
avr328p16.bootloader.unlock_bits=0x3F
avr328p16.bootloader.lock_bits=0x3F

avr328p16.build.mcu=atmega328p
avr328p16.build.f_cpu=16000000L
avr328p16.build.core=arduino

############################################
avrmega644p.name= ATmega644P / Int.8MHz
avrmega644p.upload.using=arduino:arduinoisp
avrmega644p.upload.maximum_size=65536

avrmega644p.bootloader.low_fuses=0xe2
avrmega644p.bootloader.high_fuses=0xde
avrmega644p.bootloader.extended_fuses=0xfd
avrmega644p.bootloader.path=dummy
avrmega644p.bootloader.file=dummy.hex
avrmega644p.bootloader.unlock_bits=0x3F
avrmega644p.bootloader.lock_bits=0x3F

avrmega644p.build.mcu=atmega644p
avrmega644p.build.f_cpu=8000000L
avrmega644p.build.core=atmega644p_1284p

############################################
avrmega644p16.name= ATmega644P / Ext.16MHz
avrmega644p16.upload.using=arduino:arduinoisp
avrmega644p16.upload.maximum_size=65536

avrmega644p16.bootloader.low_fuses=0xff
avrmega644p16.bootloader.high_fuses=0xde
avrmega644p16.bootloader.extended_fuses=0xfd
avrmega644p16.bootloader.path=dummy
avrmega644p16.bootloader.file=dummy.hex
avrmega644p16.bootloader.unlock_bits=0x3F
avrmega644p16.bootloader.lock_bits=0x3F

avrmega644p16.build.mcu=atmega644p
avrmega644p16.build.f_cpu=16000000L
avrmega644p16.build.core=atmega644p_1284p

############################################
avrmega1284p.name= ATmega1284P / Int.8MHz
avrmega1284p.upload.using=arduino:arduinoisp
avrmega1284p.upload.maximum_size=131072

avrmega1284p.bootloader.low_fuses=0xe2
avrmega1284p.bootloader.high_fuses=0xde
avrmega1284p.bootloader.extended_fuses=0xfd
avrmega1284p.bootloader.path=dummy
avrmega1284p.bootloader.file=dummy.hex
avrmega1284p.bootloader.unlock_bits=0x3F
avrmega1284p.bootloader.lock_bits=0x3F

avrmega1284p.build.mcu=atmega1284p
avrmega1284p.build.f_cpu=8000000L
avrmega1284p.build.core=atmega644p_1284p

############################################
avrmega1284p16.name= ATmega1284P / Ext.16MHz
avrmega1284p16.upload.using=arduino:arduinoisp
avrmega1284p16.upload.maximum_size=131072

avrmega1284p16.bootloader.low_fuses=0xff
avrmega1284p16.bootloader.high_fuses=0xde
avrmega1284p16.bootloader.extended_fuses=0xfd
avrmega1284p16.bootloader.path=dummy
avrmega1284p16.bootloader.file=dummy.hex
avrmega1284p16.bootloader.unlock_bits=0x3F
avrmega1284p16.bootloader.lock_bits=0x3F

avrmega1284p16.build.mcu=atmega1284p
avrmega1284p16.build.f_cpu=16000000L
avrmega1284p16.build.core=atmega644p_1284p

